package app.play;

import java.io.IOException;

//1. 분류할 물건 정하기
/*
1. 개수 - 입력값
2. 난이도 - 입력값
3. 테이블 - 저장소, 카운터 테이블, 게임 테이블

2. 디테일

1. 카드 - ID, 이름, 배치번호, Pair 완료 여부
 */
public class Play {
    public void playGame() {
        //ToDo
        //1. 오프닝 텍스트 출력
        //2. 플레이 방법 소개 출력
        //3. 엔터를 입력 받아서 게임 시작
        //4. 페어 갯수(판의 크기)와 난이도(동일한 페어 개수) 입력 받기
        //5. gameTable 생성
        //6. 숫자로 숨겨져 있는 카드 테이블 출력
        //7. 맞춘 곳은 wild문자로 변환
        //8. 주어진 횟 수 안에 완료 시 성공 출력
        //9. 주어진 횟 수를 초과하면 실패
        //10. 6~9번 반복
        //11. 모두 완료 되면 시도 횟수와 실패 횟수 출력
        //12. 각각 카드 counterTable 보여주기
        //13. 종료!
    }
}



